Tekla Open API Reference for Tekla Structures 2025
DotPrintColor Enumeration
 Output color mode.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum DotPrintColor
Public Enumeration DotPrintColor
Members
Member name | Value | Description
Color | 0 |  Color mode.
BlackAndWhite | 1 |  Black and white mode.
GreyScale | 2 |  Grey scale mode.
See Also
Reference
Tekla.Structures.Drawing Namespace